app/views/messages/_message.html.erb

INSERT INTO "messages" ("content", "created_at", "updated_at", "username") VALUES (?, ?, ?, ?)  [["content", "hi"], ["created_at", Wed, 16 May 2012 14:52:45 UTC +00:00], ["updated_at", Wed, 16 May 2012 14:52:45 UTC +00:00], ["username", "abhi"]]
---
  <span class="username"><%= message.username %> :&nbsp;&nbsp;</span>
  <span class="created_at"><%= message.created_at.strftime("%H:%M:%S") %></span>