app/controllers/messages_controller.rb

INSERT INTO "messages" ("content", "created_at", "updated_at", "username") VALUES (?, ?, ?, ?)  [["content", "hi"], ["created_at", Wed, 16 May 2012 14:52:45 UTC +00:00], ["updated_at", Wed, 16 May 2012 14:52:45 UTC +00:00], ["username", "abhi"]]
---
  def create
    @message = Message.create!(params[:message])